
## Plan Result (prod)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis_access_key
  * module.et-frontend-session-storage.azurerm_private_endpoint.this[0]
  * module.et-frontend-session-storage.azurerm_redis_cache.redis
  * module.et-frontend-session-storage.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be created
  + resource "azurerm_key_vault_secret" "redis_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-prod/providers/Microsoft.KeyVault/vaults/et-prod"
      + name                    = "et-syr-redis-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.et-frontend-session-storage.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "et-syr-session-storage-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "et-syr-session-storage-cache-prod"
      + subnet_id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-2-prod"
      + tags                     = {
          + "application"         = "employment-tribunals"
          + "builtFrom"           = "https://github.com/HMCTS/et-syr-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "production"
          + "managedBy"           = "Employment Tribunals"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "et-syr-session-storage-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.et-frontend-session-storage.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + access_keys_authentication_enabled = true
      + capacity                           = 1
      + family                             = "P"
      + hostname                           = (known after apply)
      + id                                 = (known after apply)
      + location                           = "uksouth"
      + minimum_tls_version                = "1.2"
      + name                               = "et-syr-session-storage-prod"
      + non_ssl_port_enabled               = false
      + port                               = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_connection_string          = (sensitive value)
      + private_static_ip_address          = (known after apply)
      + public_network_access_enabled      = false
      + redis_version                      = "6"
      + replicas_per_master                = (known after apply)
      + replicas_per_primary               = (known after apply)
      + resource_group_name                = "et-syr-session-storage-cache-prod"
      + secondary_access_key               = (sensitive value)
      + secondary_connection_string        = (sensitive value)
      + sku_name                           = "Premium"
      + ssl_port                           = (known after apply)
      + tags                               = {
          + "application"         = "employment-tribunals"
          + "builtFrom"           = "https://github.com/HMCTS/et-syr-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "production"
          + "managedBy"           = "Employment Tribunals"
        }

      + redis_configuration {
          + authentication_enabled          = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.et-frontend-session-storage.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "et-syr-session-storage-cache-prod"
      + tags     = {
          + "application"         = "employment-tribunals"
          + "builtFrom"           = "https://github.com/HMCTS/et-syr-frontend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#et-developers"
          + "environment"         = "production"
          + "managedBy"           = "Employment Tribunals"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vaultName = "et-prod"
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":743,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->